[
  {
    "Id": "712409",
    "ThreadId": "283015",
    "Html": "\r\n<p>Hi everyone!</p>\r\n<p>My name is Terry. I am the original author of PSTSDK, and wrote pretty much every line of code in the mainline version of PSTSDK. I've been contacted by a number of people about the status of the project, so I thought a public post on the subject was needed.</p>\r\n<p>The first piece of news I want to communicate is that I'm no longer with Microsoft. I loved my time there, but last month I decided&nbsp;on a change in the direction of my career and&nbsp;moved to another software company in the Seattle area.</p>\r\n<p>What does this mean for PSTSDK? Although I initially created the project in my spare time, I was only able to do with what what was then inside knowledge of the workings of the PST (this was prior to the publication of [MS-PST]). In addition, I did a significant\r\n amount of work under the direction and support of Microsoft. I thus consider PSTSDK entirely the property of Microsoft. I'm not sure what Microsoft's plans are for the project, but I won't be part of it since I no longer work there.</p>\r\n<p>However, in true open source fashion, and in compliance with the license Microsoft makes available to everyone for PSTSDK (including me),&nbsp;I forked the project in order to finish up a few items on my todo list. That's available at\r\n<a href=\"http://github.com/terrymah/Fairport\">http://github.com/terrymah/Fairport</a> (Fairport was the original codename of PSTSDK). Note that this project is GPL, so PSTSDK (Apache) might still work better for you.</p>\r\n<p>The documentation (automatically build from source) is available at <a href=\"http://terrymah.github.com/Fairport/\">\r\nhttp://terrymah.github.com/Fairport/</a>. The project right now is largely identical to PSTSDK, but check the changelog for details.</p>\r\n<p>So to summarize, this is the current status of the PSTSDK as I see it:</p>\r\n<ul>\r\n<li>I'm no longer involved </li><li>Write support was mostly implemented in a seperate branch (but not highly tested) by another dev at Microsoft. You'll have to pull the sources yourself, it hadn't been released officially by the time I had left.\r\n</li><li>I'm generally not going to be reading/responding/providing support on the PSTSDK forums\r\n</li><li>If you want to get ahold of me, file a bug, or have a feature request your best bet is github.\r\n</li></ul>\r\n<p>-terry</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2011-12-14T15:45:37.647-08:00",
    "UserRole": "Owner",
    "MarkedAsAnswerDate": null
  }
]