[
  {
    "Id": "1294855",
    "ThreadId": "561757",
    "Html": "For transfer your emails from one email program (MBOX) to another (PST), you need a third party tool which help you to import your emails from MBOX to PST format. You can simply get it from this :- <a href=\"http://www.mboxtopstconverter.pcrecoverytools.com\" rel=\"nofollow\">http://www.mboxtopstconverter.pcrecoverytools.com</a><br />\n",
    "PostedDate": "2014-08-29T04:25:58.133-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1343141",
    "ThreadId": "561757",
    "Html": "<strong>AidaJolley wrote:</strong><br />\n<blockquote>\nOutlook uses PST file format to store user information while Thunderbird, Spice bird and other email application uses MBOX file format to store user information. MBOX to PST file conversion is little bit tough incase if we are using manual method for conversion. Moreover manual method is risky and time consuming approach because manual method will not assure user for successful conversion. To avoid such conflicts it would be better to opting for a professional MBOX to PST file converter software like <strong>Stellar MBOX to PST file converter software</strong>. To know more about software please visit their website.<br />\n</blockquote>\nHI Aida\r<br />\n<br />\nCould you please suggest me from where I get recomended softwrare.\r<br />\n<br />\nThanks In Advance<br />\n",
    "PostedDate": "2015-01-18T22:42:59.61-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1498484",
    "ThreadId": "561757",
    "Html": "<a href=\"https://osttopst.recoverytoolbox.com/\" rel=\"nofollow\">Recovery Toolbox for Outlook</a> can convert .pst files from any version of Microsoft Outlook or any version of Microsoft Exchange Server into the .pst file format without Exchange Server or Windows Domain Controller.<br />\n",
    "PostedDate": "2017-11-27T07:00:35.127-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]